# Label Encoder:

- Sklearn provides a very efficient tool for encoding the levels of categorical features into numeric values. 
- LabelEncoder encode labels with a value between 0 and n_classes-1 where n is the number of distinct labels.

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import warnings

warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('Social_Ads.csv')

In [3]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.drop(columns=['User ID'], inplace=True)

In [5]:
df.shape

(400, 4)

In [6]:
x = df.iloc[:, :-1]
y = df.iloc[:, 3]

In [7]:
x.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [8]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
x['Gender'] = encoder.fit_transform(x['Gender'])

In [9]:
x.head()

   Gender  Age  EstimatedSalary
0       1   19            19000
1       1   35            20000
2       0   26            43000
3       0   27            57000
4       1   19            76000

### You can always convert back from binary to label data

In [10]:
x['temp'] = encoder.inverse_transform(x['Gender'])

In [11]:
x.head()

   Gender  Age  EstimatedSalary    temp
0       1   19            19000    Male
1       1   35            20000    Male
2       0   26            43000  Female
3       0   27            57000  Female
4       1   19            76000    Male

In [12]:
x.drop(columns=['temp'], inplace=True)